// Реализовать переключение темы с помощью контекста
// После обновления тема оставалось выбранной -- localStorage, indexDB, cookie (для куков можно использовать библиотеку react-cookie, либо же использовать дефолтные js cookie)
// Дизайн на ваше усмотрение -- если хотите, вы можете использовать библиотеки для стилизации, например: tailwind, chakra ui, material ui и т.д

// Хранится тема будет в контексте, далее записывать в любое из хранилищ, и далее использовать и перезаписывать тему в хранилище на ваше усмотрение